---
kind: method
id: M:Autodesk.Revit.DB.TessellatedBuildIssue.IsValidIssue
source: html/3d5943e5-deb3-2daf-e528-78d498e6b038.htm
---
# Autodesk.Revit.DB.TessellatedBuildIssue.IsValidIssue Method

Reports whether the issue is well-formed, valid and does
 describe a real problem.

## Syntax (C#)
```csharp
public bool IsValidIssue()
```

## Returns
Whether the issue is well formed and does describe a real problem.